<template>
  <div class="grid-layout_building">
    <CategoryHeader>
      Видео
      <template v-slot:right_column>
        <svg
          width="395"
          height="395"
          viewBox="0 0 395 395"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g filter="url(#filter0_f)">
            <circle
              cx="197.5"
              cy="197.5"
              r="184.5"
              fill="#0E243E"
              fill-opacity="0.1"
            />
            <circle
              cx="197.5"
              cy="197.5"
              r="184.5"
              stroke="#7BD7FF"
              stroke-width="6"
            />
          </g>
          <g filter="url(#filter1_f)">
            <circle
              cx="197.5"
              cy="197.5"
              r="184.5"
              fill="#0E243E"
              fill-opacity="0.1"
            />
            <circle
              cx="197.5"
              cy="197.5"
              r="183"
              stroke="white"
              stroke-width="3"
            />
          </g>
          <g filter="url(#filter2_f)">
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M291.61 160.054H136.35L285.479 116.853C286.638 116.517 287.616 115.733 288.199 114.677C288.782 113.62 288.921 112.375 288.585 111.216L280.781 84.276C277.663 73.5159 267.644 66 256.416 66C254.05 66 251.693 66.336 249.407 66.9973L109.39 107.558C102.914 109.433 97.5478 113.739 94.2751 119.678C91.0042 125.617 90.2363 132.456 92.1117 138.93L99.736 165.25V273.674C99.736 287.639 111.097 299 125.06 299H179.744C182.258 299 184.295 296.963 184.295 294.449C184.295 291.936 182.258 289.898 179.744 289.898H125.062C116.115 289.898 108.838 282.621 108.838 273.674V211.744H132.151H132.162H132.171H167.809H167.82H167.831H203.469H203.48H203.49H239.129H239.139H239.148H287.059V273.674C287.059 282.621 279.782 289.898 270.835 289.898H216.151C213.639 289.898 211.6 291.936 211.6 294.449C211.6 296.963 213.639 299 216.151 299H270.835C284.8 299 296.161 287.639 296.161 273.674V164.604C296.161 162.091 294.124 160.054 291.61 160.054ZM211.365 202.643L230.701 169.155H255.849L236.515 202.643H211.365ZM175.706 202.643L195.041 169.155H220.19L200.856 202.643H175.706ZM140.048 202.643L159.382 169.155H184.532L165.196 202.643H140.048ZM156.967 143.729L124.589 112.631L148.849 105.604C149.02 105.853 149.219 106.088 149.446 106.306L181.824 137.405L157.565 144.432C157.394 144.183 157.193 143.946 156.967 143.729ZM217.948 86.4625L250.326 117.561L226.066 124.588C225.896 124.339 225.697 124.102 225.469 123.886L193.091 92.7874L217.351 85.7603C217.521 86.0092 217.72 86.2439 217.948 86.4625ZM183.696 96.3854L216.074 127.482L191.815 134.511C191.644 134.262 191.445 134.025 191.217 133.808L158.839 102.71L183.099 95.6832C183.271 95.9303 183.47 96.1667 183.696 96.3854ZM251.94 75.7397C253.401 75.3167 254.907 75.1016 256.416 75.1016C263.617 75.1016 270.04 79.9154 272.038 86.8092L278.576 109.376L260.318 114.665C260.146 114.416 259.947 114.181 259.719 113.963L227.343 82.8663L251.94 75.7397ZM102.248 124.069C104.345 120.259 107.782 117.5 111.924 116.3L114.597 115.525C114.77 115.774 114.969 116.011 115.194 116.227L147.573 147.326L107.392 158.966L100.854 136.398C99.6543 132.258 100.15 127.88 102.248 124.069ZM108.838 169.155H148.872L129.538 202.643H108.838V169.155ZM247.025 202.643L266.359 169.155H287.059V202.643H247.025Z"
              fill="#7BD7FF"
            />
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M229.416 250.358C229.416 248.732 228.548 247.23 227.14 246.417L187.159 223.334C185.751 222.522 184.016 222.522 182.608 223.334C181.201 224.147 180.333 225.649 180.333 227.275V273.441C180.333 275.066 181.201 276.568 182.608 277.38C183.312 277.787 184.098 277.992 184.884 277.992C185.67 277.992 186.455 277.787 187.159 277.38L227.14 254.299C228.548 253.487 229.416 251.985 229.416 250.358ZM189.435 265.559V235.158L215.763 250.358L189.435 265.559Z"
              fill="#7BD7FF"
            />
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M197.948 289.898C195.441 289.898 193.397 291.943 193.397 294.449C193.397 296.956 195.441 299 197.948 299C200.456 299 202.499 296.956 202.499 294.449C202.499 291.943 200.456 289.898 197.948 289.898Z"
              fill="#7BD7FF"
            />
          </g>
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M291.61 160.054H136.35L285.479 116.853C286.638 116.517 287.616 115.733 288.199 114.677C288.782 113.62 288.921 112.375 288.585 111.216L280.781 84.276C277.663 73.5159 267.644 66 256.416 66C254.05 66 251.693 66.336 249.407 66.9973L109.39 107.558C102.914 109.433 97.5478 113.739 94.2751 119.678C91.0042 125.617 90.2363 132.456 92.1117 138.93L99.736 165.25V273.674C99.736 287.639 111.097 299 125.06 299H179.744C182.258 299 184.295 296.963 184.295 294.449C184.295 291.936 182.258 289.898 179.744 289.898H125.062C116.115 289.898 108.838 282.621 108.838 273.674V211.744H132.151H132.162H132.171H167.809H167.82H167.831H203.469H203.48H203.49H239.129H239.139H239.148H287.059V273.674C287.059 282.621 279.782 289.898 270.835 289.898H216.151C213.639 289.898 211.6 291.936 211.6 294.449C211.6 296.963 213.639 299 216.151 299H270.835C284.8 299 296.161 287.639 296.161 273.674V164.604C296.161 162.091 294.124 160.054 291.61 160.054ZM211.365 202.643L230.701 169.155H255.849L236.515 202.643H211.365ZM175.706 202.643L195.041 169.155H220.19L200.856 202.643H175.706ZM140.048 202.643L159.382 169.155H184.532L165.196 202.643H140.048ZM156.967 143.729L124.589 112.631L148.849 105.604C149.02 105.853 149.219 106.088 149.446 106.306L181.824 137.405L157.565 144.432C157.394 144.183 157.193 143.946 156.967 143.729ZM217.948 86.4625L250.326 117.561L226.066 124.588C225.896 124.339 225.697 124.102 225.469 123.886L193.091 92.7874L217.351 85.7603C217.521 86.0092 217.72 86.2439 217.948 86.4625ZM183.696 96.3854L216.074 127.482L191.815 134.511C191.644 134.262 191.445 134.025 191.217 133.808L158.839 102.71L183.099 95.6832C183.271 95.9303 183.47 96.1667 183.696 96.3854ZM251.94 75.7397C253.401 75.3167 254.907 75.1016 256.416 75.1016C263.617 75.1016 270.04 79.9154 272.038 86.8092L278.576 109.376L260.318 114.665C260.146 114.416 259.947 114.181 259.719 113.963L227.343 82.8663L251.94 75.7397ZM102.248 124.069C104.345 120.259 107.782 117.5 111.924 116.3L114.597 115.525C114.77 115.774 114.969 116.011 115.194 116.227L147.573 147.326L107.392 158.966L100.854 136.398C99.6543 132.258 100.15 127.88 102.248 124.069ZM108.838 169.155H148.872L129.538 202.643H108.838V169.155ZM247.025 202.643L266.359 169.155H287.059V202.643H247.025Z"
            fill="white"
          />
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M229.416 250.358C229.416 248.732 228.548 247.23 227.14 246.417L187.159 223.334C185.751 222.522 184.016 222.522 182.608 223.334C181.201 224.147 180.333 225.649 180.333 227.275V273.441C180.333 275.066 181.201 276.568 182.608 277.38C183.312 277.787 184.098 277.992 184.884 277.992C185.67 277.992 186.455 277.787 187.159 277.38L227.14 254.299C228.548 253.487 229.416 251.985 229.416 250.358ZM189.435 265.559V235.158L215.763 250.358L189.435 265.559Z"
            fill="white"
          />
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M197.948 289.898C195.441 289.898 193.397 291.943 193.397 294.449C193.397 296.956 195.441 299 197.948 299C200.456 299 202.499 296.956 202.499 294.449C202.499 291.943 200.456 289.898 197.948 289.898Z"
            fill="white"
          />
          <defs>
            <filter
              id="filter0_f"
              x="0"
              y="0"
              width="395"
              height="395"
              filterUnits="userSpaceOnUse"
              color-interpolation-filters="sRGB"
            >
              <feFlood flood-opacity="0" result="BackgroundImageFix" />
              <feBlend
                mode="normal"
                in="SourceGraphic"
                in2="BackgroundImageFix"
                result="shape"
              />
              <feGaussianBlur
                stdDeviation="5"
                result="effect1_foregroundBlur"
              />
            </filter>
            <filter
              id="filter1_f"
              x="10"
              y="10"
              width="375"
              height="375"
              filterUnits="userSpaceOnUse"
              color-interpolation-filters="sRGB"
            >
              <feFlood flood-opacity="0" result="BackgroundImageFix" />
              <feBlend
                mode="normal"
                in="SourceGraphic"
                in2="BackgroundImageFix"
                result="shape"
              />
              <feGaussianBlur
                stdDeviation="1.5"
                result="effect1_foregroundBlur"
              />
            </filter>
            <filter
              id="filter2_f"
              x="52"
              y="41"
              width="283"
              height="283"
              filterUnits="userSpaceOnUse"
              color-interpolation-filters="sRGB"
            >
              <feFlood flood-opacity="0" result="BackgroundImageFix" />
              <feBlend
                mode="normal"
                in="SourceGraphic"
                in2="BackgroundImageFix"
                result="shape"
              />
              <feGaussianBlur
                stdDeviation="12.5"
                result="effect1_foregroundBlur"
              />
            </filter>
          </defs>
        </svg>
      </template>
    </CategoryHeader>
    <div
      class="container grid__column_12 grid_cols_2 grid_cols_4_tablet grid_cols_6_desktop buttons_grid"
    >
      <Button
        to="выставки"
        shape="semi_rounded"
        borders="outline"
        class="grid__column_2"
        height="100%"
        >Выставки</Button
      >
      <Button
        to="форумы"
        shape="semi_rounded"
        borders="outline"
        class="grid__column_2"
        height="100%"
        >Форумы</Button
      >
      <Button
        to="фирмы-и-магазины"
        shape="semi_rounded"
        borders="outline"
        class="grid__column_2"
        height="100%"
        >Фирмы</Button
      >
      <Button
        to="частники"
        shape="semi_rounded"
        borders="outline"
        class="grid__column_2"
        height="100%"
        >Частники</Button
      >
      <Button
        to="блогеры"
        shape="semi_rounded"
        borders="outline"
        class="grid__column_2"
        height="100%"
        >Блогеры</Button
      >
      <Button
        to="обучающие"
        shape="semi_rounded"
        borders="outline"
        class="grid__column_2"
        height="100%"
        >Обучающие</Button
      >
    </div>
  </div>
</template>

<script>
import CategoryHeader from '../../components/Category/Header/CategoryHeader'
export default {
  layout: 'Category',
  components: {
    CategoryHeader,
  },
}
</script>

<style scoped lang="scss">
@import '~assets/scss/app/index.scss';
.grid-layout_building {
  max-height: 100%;
  display: grid;
  grid-template-columns: repeat(12, 1fr);
  grid-template-rows: auto auto;
  grid-row-gap: 10px;
  grid-column-gap: 20px;
  height: calc(100vh - 65px);
  padding-bottom: 0.5vw;
}
.buttons_grid {
  grid-gap: 15px;
  grid-auto-rows: 42px;
  @include media_screen(desktop-wide) {
    grid-auto-rows: 90px;
    grid-gap: 30px;
  }
}
</style>
