<template>
  <div class="container_wide layout_category grid-layout">
    <CategoryHeader>
      Механизация, спецтехника
      <template v-slot:right_column>
        <svg
          width="395"
          height="395"
          viewBox="0 0 395 395"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g filter="url(#filter0_f)">
            <circle
              cx="197.5"
              cy="197.5"
              r="184.5"
              fill="#0E243E"
              fill-opacity="0.1"
            />
            <circle
              cx="197.5"
              cy="197.5"
              r="184.5"
              stroke="#7BD7FF"
              stroke-width="6"
            />
          </g>
          <g filter="url(#filter1_f)">
            <circle
              cx="197.5"
              cy="197.5"
              r="184.5"
              fill="#0E243E"
              fill-opacity="0.1"
            />
            <circle
              cx="197.5"
              cy="197.5"
              r="183"
              stroke="white"
              stroke-width="3"
            />
          </g>
          <g filter="url(#filter2_f)">
            <path
              d="M115.836 268.083C109.485 268.083 104.336 273.232 104.336 279.583C104.336 285.935 109.484 291.083 115.836 291.083C122.187 291.083 127.336 285.935 127.336 279.583C127.329 273.235 122.184 268.091 115.836 268.083ZM115.836 283.417C113.719 283.417 112.003 281.701 112.003 279.584C112.003 277.467 113.719 275.751 115.836 275.751C117.953 275.751 119.669 277.467 119.669 279.584C119.667 281.7 117.952 283.415 115.836 283.417Z"
              fill="#7BD7FF"
            />
            <path
              d="M219.336 279.583C219.336 285.935 224.484 291.083 230.836 291.083C237.187 291.083 242.336 285.935 242.336 279.583C242.336 273.232 237.187 268.083 230.836 268.083C224.488 268.091 219.343 273.235 219.336 279.583ZM234.67 279.583C234.67 281.701 232.954 283.417 230.836 283.417C228.719 283.417 227.003 281.701 227.003 279.583C227.003 277.466 228.719 275.75 230.836 275.75C232.952 275.753 234.667 277.467 234.67 279.583Z"
              fill="#7BD7FF"
            />
            <path
              d="M142.667 187.583C143.683 187.584 144.659 187.18 145.378 186.461C146.096 185.742 146.5 184.767 146.5 183.75V179.917C146.5 177.8 144.784 176.083 142.667 176.083C140.55 176.083 138.834 177.8 138.834 179.917V183.75C138.834 184.766 139.237 185.742 139.957 186.461C140.674 187.18 141.65 187.584 142.667 187.583Z"
              fill="#7BD7FF"
            />
            <path
              d="M142.667 206.75C143.683 206.75 144.659 206.347 145.378 205.627C146.096 204.909 146.5 203.933 146.5 202.916V199.083C146.5 196.966 144.784 195.25 142.667 195.25C140.55 195.25 138.834 196.966 138.834 199.083V202.916C138.834 203.933 139.237 204.908 139.957 205.627C140.674 206.347 141.65 206.75 142.667 206.75Z"
              fill="#7BD7FF"
            />
            <path
              d="M316.631 157.212C316.167 157.019 315.669 156.918 315.167 156.917H258.318C257.301 156.917 256.325 157.321 255.606 158.04L222.689 190.994C218.057 188.755 212.979 187.589 207.833 187.583V173.062C207.833 172.881 207.79 172.707 207.777 172.527C207.785 172.43 207.833 172.348 207.833 172.25C207.82 171.628 207.652 171.019 207.344 170.478C207.281 170.302 207.247 170.119 207.171 169.947L183.694 117.124L183.663 117.055L177.848 103.969C176.617 101.201 173.871 99.4174 170.842 99.417H96.6668C92.4343 99.4215 89.0049 102.851 89 107.083V210.583C89.009 219.048 95.8686 225.908 104.333 225.917H108.166V256.583C97.5864 256.596 89.0126 265.17 89 275.75V283.417C89.0126 293.997 97.5864 302.571 108.167 302.584H238.5C249.08 302.571 257.654 293.997 257.667 283.417V275.75C257.654 266.647 251.251 258.804 242.334 256.971V222.084C242.328 216.938 241.163 211.86 238.924 207.228L266.269 179.917H296V243.956L262.108 296.677C261.349 297.856 261.295 299.356 261.967 300.587C262.639 301.819 263.93 302.584 265.333 302.584H299.833C310.414 302.571 318.987 293.997 319 283.417V160.75C318.994 159.201 318.061 157.807 316.631 157.212ZM207.833 195.25C221.166 195.267 232.471 205.057 234.393 218.25H207.833V195.25ZM234.667 225.917V256.584H192.5V225.917H234.667ZM177.657 122.417L198.102 168.417H154.166V122.417H177.657ZM96.6668 122.417H131.167L131.172 168.417H96.6668V122.417ZM104.333 218.25C100.101 218.245 96.6713 214.815 96.6664 210.583V176.083H131.166C135.398 176.078 138.828 172.649 138.833 168.417V122.417C138.828 118.184 135.398 114.755 131.166 114.75H96.6664V107.083H170.842L174.25 114.75H154.167C149.935 114.755 146.505 118.184 146.5 122.417V168.417C146.505 172.649 149.934 176.079 154.167 176.084H200.167L200.169 191.406L200.167 191.417V218.25H146.5C146.5 216.133 144.784 214.417 142.667 214.417C140.55 214.417 138.834 216.133 138.834 218.25H104.333ZM154.167 245.083V237.417H184.834V245.083H154.167ZM184.833 252.75V256.583H154.166V252.75H184.833ZM154.167 229.75V225.917H184.834V229.75H154.167ZM146.5 225.917V256.584H115.833V225.917H146.5ZM250 275.75V283.417C249.993 289.765 244.848 294.91 238.5 294.917H108.167C101.818 294.91 96.6736 289.765 96.6668 283.417V275.75C96.6736 269.402 101.818 264.257 108.167 264.25H238.5C244.848 264.257 249.993 269.402 250 275.75ZM234.75 200.558C233.156 198.569 231.348 196.761 229.359 195.167L256.843 167.651L260.453 174.888L234.75 200.558ZM267.706 172.25L263.882 164.583H305.913L298.246 172.25H267.706ZM311.333 283.417C311.326 289.765 306.182 294.91 299.833 294.917H272.354L301.926 248.917H311.333V283.417ZM311.333 241.25H303.666V177.671L311.333 170.004V241.25Z"
              fill="#7BD7FF"
            />
            <path
              d="M108.168 141.583C109.186 141.585 110.161 141.18 110.879 140.46L114.712 136.627C116.186 135.126 116.174 132.718 114.688 131.231C113.201 129.744 110.792 129.733 109.292 131.207L105.458 135.04C104.362 136.136 104.035 137.785 104.628 139.217C105.221 140.649 106.618 141.583 108.168 141.583Z"
              fill="#7BD7FF"
            />
            <path
              d="M116.956 142.707L105.456 154.207C104.473 155.172 104.084 156.591 104.436 157.922C104.789 159.254 105.829 160.294 107.161 160.647C108.493 160.999 109.911 160.61 110.876 159.627L122.376 148.127C123.85 146.626 123.839 144.218 122.352 142.731C120.865 141.244 118.456 141.233 116.956 142.707Z"
              fill="#7BD7FF"
            />
          </g>
          <path
            d="M115.836 268.083C109.485 268.083 104.336 273.232 104.336 279.583C104.336 285.935 109.484 291.083 115.836 291.083C122.187 291.083 127.336 285.935 127.336 279.583C127.329 273.235 122.184 268.091 115.836 268.083ZM115.836 283.417C113.719 283.417 112.003 281.701 112.003 279.584C112.003 277.467 113.719 275.751 115.836 275.751C117.953 275.751 119.669 277.467 119.669 279.584C119.667 281.7 117.952 283.415 115.836 283.417Z"
            fill="white"
          />
          <path
            d="M219.336 279.583C219.336 285.935 224.484 291.083 230.836 291.083C237.187 291.083 242.336 285.935 242.336 279.583C242.336 273.232 237.187 268.083 230.836 268.083C224.488 268.091 219.343 273.235 219.336 279.583ZM234.67 279.583C234.67 281.701 232.954 283.417 230.836 283.417C228.719 283.417 227.003 281.701 227.003 279.583C227.003 277.466 228.719 275.75 230.836 275.75C232.952 275.753 234.667 277.467 234.67 279.583Z"
            fill="white"
          />
          <path
            d="M142.667 187.583C143.683 187.584 144.659 187.18 145.378 186.461C146.096 185.742 146.5 184.767 146.5 183.75V179.917C146.5 177.8 144.784 176.083 142.667 176.083C140.55 176.083 138.834 177.8 138.834 179.917V183.75C138.834 184.766 139.237 185.742 139.957 186.461C140.674 187.18 141.65 187.584 142.667 187.583Z"
            fill="white"
          />
          <path
            d="M142.667 206.75C143.683 206.75 144.659 206.347 145.378 205.627C146.096 204.909 146.5 203.933 146.5 202.916V199.083C146.5 196.966 144.784 195.25 142.667 195.25C140.55 195.25 138.834 196.966 138.834 199.083V202.916C138.834 203.933 139.237 204.908 139.957 205.627C140.674 206.347 141.65 206.75 142.667 206.75Z"
            fill="white"
          />
          <path
            d="M316.631 157.212C316.167 157.019 315.669 156.918 315.167 156.917H258.318C257.301 156.917 256.325 157.321 255.606 158.04L222.689 190.994C218.057 188.755 212.979 187.589 207.833 187.583V173.062C207.833 172.881 207.79 172.707 207.777 172.527C207.785 172.43 207.833 172.348 207.833 172.25C207.82 171.628 207.652 171.019 207.344 170.478C207.281 170.302 207.247 170.119 207.171 169.947L183.694 117.124L183.663 117.055L177.848 103.969C176.617 101.201 173.871 99.4174 170.842 99.417H96.6668C92.4343 99.4215 89.0049 102.851 89 107.083V210.583C89.009 219.048 95.8686 225.908 104.333 225.917H108.166V256.583C97.5864 256.596 89.0126 265.17 89 275.75V283.417C89.0126 293.997 97.5864 302.571 108.167 302.584H238.5C249.08 302.571 257.654 293.997 257.667 283.417V275.75C257.654 266.647 251.251 258.804 242.334 256.971V222.084C242.328 216.938 241.163 211.86 238.924 207.228L266.269 179.917H296V243.956L262.108 296.677C261.349 297.856 261.295 299.356 261.967 300.587C262.639 301.819 263.93 302.584 265.333 302.584H299.833C310.414 302.571 318.987 293.997 319 283.417V160.75C318.994 159.201 318.061 157.807 316.631 157.212ZM207.833 195.25C221.166 195.267 232.471 205.057 234.393 218.25H207.833V195.25ZM234.667 225.917V256.584H192.5V225.917H234.667ZM177.657 122.417L198.102 168.417H154.166V122.417H177.657ZM96.6668 122.417H131.167L131.172 168.417H96.6668V122.417ZM104.333 218.25C100.101 218.245 96.6713 214.815 96.6664 210.583V176.083H131.166C135.398 176.078 138.828 172.649 138.833 168.417V122.417C138.828 118.184 135.398 114.755 131.166 114.75H96.6664V107.083H170.842L174.25 114.75H154.167C149.935 114.755 146.505 118.184 146.5 122.417V168.417C146.505 172.649 149.934 176.079 154.167 176.084H200.167L200.169 191.406L200.167 191.417V218.25H146.5C146.5 216.133 144.784 214.417 142.667 214.417C140.55 214.417 138.834 216.133 138.834 218.25H104.333ZM154.167 245.083V237.417H184.834V245.083H154.167ZM184.833 252.75V256.583H154.166V252.75H184.833ZM154.167 229.75V225.917H184.834V229.75H154.167ZM146.5 225.917V256.584H115.833V225.917H146.5ZM250 275.75V283.417C249.993 289.765 244.848 294.91 238.5 294.917H108.167C101.818 294.91 96.6736 289.765 96.6668 283.417V275.75C96.6736 269.402 101.818 264.257 108.167 264.25H238.5C244.848 264.257 249.993 269.402 250 275.75ZM234.75 200.558C233.156 198.569 231.348 196.761 229.359 195.167L256.843 167.651L260.453 174.888L234.75 200.558ZM267.706 172.25L263.882 164.583H305.913L298.246 172.25H267.706ZM311.333 283.417C311.326 289.765 306.182 294.91 299.833 294.917H272.354L301.926 248.917H311.333V283.417ZM311.333 241.25H303.666V177.671L311.333 170.004V241.25Z"
            fill="white"
          />
          <path
            d="M108.168 141.583C109.186 141.585 110.161 141.18 110.879 140.46L114.712 136.627C116.186 135.126 116.174 132.718 114.688 131.231C113.201 129.744 110.792 129.733 109.292 131.207L105.458 135.04C104.362 136.136 104.035 137.785 104.628 139.217C105.221 140.649 106.618 141.583 108.168 141.583Z"
            fill="white"
          />
          <path
            d="M116.956 142.707L105.456 154.207C104.473 155.172 104.084 156.591 104.436 157.922C104.789 159.254 105.829 160.294 107.161 160.647C108.493 160.999 109.911 160.61 110.876 159.627L122.376 148.127C123.85 146.626 123.839 144.218 122.352 142.731C120.865 141.244 118.456 141.233 116.956 142.707Z"
            fill="white"
          />
          <defs>
            <filter
              id="filter0_f"
              x="0"
              y="0"
              width="395"
              height="395"
              filterUnits="userSpaceOnUse"
              color-interpolation-filters="sRGB"
            >
              <feFlood flood-opacity="0" result="BackgroundImageFix" />
              <feBlend
                mode="normal"
                in="SourceGraphic"
                in2="BackgroundImageFix"
                result="shape"
              />
              <feGaussianBlur
                stdDeviation="5"
                result="effect1_foregroundBlur"
              />
            </filter>
            <filter
              id="filter1_f"
              x="10"
              y="10"
              width="375"
              height="375"
              filterUnits="userSpaceOnUse"
              color-interpolation-filters="sRGB"
            >
              <feFlood flood-opacity="0" result="BackgroundImageFix" />
              <feBlend
                mode="normal"
                in="SourceGraphic"
                in2="BackgroundImageFix"
                result="shape"
              />
              <feGaussianBlur
                stdDeviation="1.5"
                result="effect1_foregroundBlur"
              />
            </filter>
            <filter
              id="filter2_f"
              x="64"
              y="61"
              width="280"
              height="280"
              filterUnits="userSpaceOnUse"
              color-interpolation-filters="sRGB"
            >
              <feFlood flood-opacity="0" result="BackgroundImageFix" />
              <feBlend
                mode="normal"
                in="SourceGraphic"
                in2="BackgroundImageFix"
                result="shape"
              />
              <feGaussianBlur
                stdDeviation="12.5"
                result="effect1_foregroundBlur"
              />
            </filter>
          </defs>
        </svg>
      </template>
    </CategoryHeader>
    <div class="card grid__column_12 grid__column_6-tablet">
      <h2>Все фирмы</h2>
      <div class="card__content grid_cols_2">
        <div class="card__item">
          <span class="card__title">Строительная техника</span>
          <Button
            to="строительная-техника/фирмы-и-магазины"
            shape="rounded"
            borders="outline"
            >Подробнее</Button
          >
        </div>
        <div class="card__item">
          <span class="card__title">Дорожная техника</span>
          <Button
            to="дорожная-техника/фирмы-и-магазины"
            shape="rounded"
            borders="outline"
            >Подробнее</Button
          >
        </div>
        <div class="card__item">
          <span class="card__title">Транспортная техника</span>
          <Button
            to="транспортная-техника/фирмы-и-магазины"
            shape="rounded"
            borders="outline"
            >Подробнее</Button
          >
        </div>
        <div class="card__item">
          <span class="card__title">Коммунальная техника</span>
          <Button
            to="коммунальная-техника/фирмы-и-магазины"
            shape="rounded"
            borders="outline"
            >Подробнее</Button
          >
        </div>
      </div>
    </div>
    <div class="card grid__column_6-tablet grid__column_12">
      <h2>Все частники</h2>
      <div class="card__content grid_cols_2">
        <div class="card__item">
          <span class="card__title">Строительная техника</span>
          <Button
            to="строительная-техника/частники"
            shape="rounded"
            borders="outline"
            >Подробнее</Button
          >
        </div>
        <div class="card__item">
          <span class="card__title">Дорожная техника</span>
          <Button
            to="дорожная-техника/частники"
            shape="rounded"
            borders="outline"
            >Подробнее</Button
          >
        </div>
        <div class="card__item">
          <span class="card__title">Транспортная техника</span>
          <Button
            to="транспортная-техника/частники"
            shape="rounded"
            borders="outline"
            >Подробнее</Button
          >
        </div>
        <div class="card__item">
          <span class="card__title">Коммунальная техника</span>
          <Button
            to="коммунальная-техника/частники"
            shape="rounded"
            borders="outline"
            >Подробнее</Button
          >
        </div>
      </div>
    </div>
    <div class="card grid__column_12">
      <h2>Продажа строительной техники</h2>
      <div class="card__content grid_cols_2 grid_cols_4_tablet">
        <div class="card__item">
          <span class="card__title">Строительная техника</span>
          <Button
            to="строительная-техника/продажа"
            shape="rounded"
            borders="outline"
            >Подробнее</Button
          >
        </div>
        <div class="card__item">
          <span class="card__title">Дорожная техника</span>
          <Button
            to="дорожная-техника/продажа"
            shape="rounded"
            borders="outline"
            >Подробнее</Button
          >
        </div>
        <div class="card__item">
          <span class="card__title">Транспортная техника</span>
          <Button
            to="транспортная-техника/продажа"
            shape="rounded"
            borders="outline"
            >Подробнее</Button
          >
        </div>
        <div class="card__item">
          <span class="card__title">Коммунальная техника</span>
          <Button
            to="коммунальная-техника/продажа"
            shape="rounded"
            borders="outline"
            >Подробнее</Button
          >
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import CategoryHeader from '../../components/Category/Header/CategoryHeader'
export default {
  layout: 'Category',
  components: {
    CategoryHeader,
  },
}
</script>

<style scoped lang="scss">
@import '~assets/scss/app/index.scss';
.grid-layout {
  max-height: 100%;
  display: grid;
  grid-template-columns: repeat(12, 1fr);
  grid-template-rows: auto auto auto;
  grid-row-gap: 30px;
  grid-column-gap: 20px;
  @include on_tablet() {
    grid-row-gap: 10px;
    height: 88vh;
  }
  @include media_screen(desktop-fhd) {
    grid-template-rows: 2fr 2fr auto;
  }
}
.card {
  display: grid;
  grid-template-rows: 1fr auto;
  /*grid-gap: 30px;*/
  /*justify-items: center;*/
  padding: 0 20px;
  $shadow-value: 15px;
  @include on_tablet() {
    border-radius: 4rem;
    border: 2px solid rgba(255, 255, 255, 0.5);
    box-shadow: 0 0 $shadow-value 1px #7bd7ff,
      0 0 $shadow-value 1px #7bd7ff inset;
  }
  @include media_screen(desktop-wide) {
    padding: 0 40px;
  }
  h2 {
    text-align: center;
    align-self: center;
    border-bottom: 1px solid rgba(255, 255, 255, 0.5);
    margin: 0 auto;
    width: 100%;
    padding: 2%;
    @include on_tablet() {
      width: 80%;
    }
    @include media_screen(desktop-wide, max) {
      font-size: 0.95rem;
      padding: 1.25%;
    }
    @include on_mobile() {
      font-size: 1.15rem;
      margin-bottom: 10px;
    }
  }
  &__content {
    grid-column-gap: 10px;
    grid-row-gap: 10px;
    padding: 5px 10px;
    margin: 0 auto;
    @include on_tablet() {
      grid-column-gap: 30px;
      padding: 5px 30px;
      width: 80%;
    }
    @include media_screen(desktop-wide) {
      padding: 10px 30px;
    }
  }
  &__item {
    display: grid;
    grid-template-rows: minmax(30px, 1fr) 1fr;
    grid-row-gap: 5px;
    @include media_screen(desktop-wide) {
      grid-template-rows: minmax(50px, 1fr) 1fr;
    }
    span {
      font-size: 1rem;
      @include media_screen(desktop-wide) {
        font-size: 20px;
      }
    }
    /deep/ .button {
      align-self: center;
    }
  }
  &__title {
    font-weight: bold;
    font-size: 20px;
    text-align: center;
    align-self: center;
  }
}
</style>
