<template>
  <div class="grid-layout_building">
    <CategoryHeader>
      Форумы
      <template v-slot:right_column>
        <svg
          width="395"
          height="395"
          viewBox="0 0 395 395"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g filter="url(#filter0_f)">
            <circle
              cx="197.5"
              cy="197.5"
              r="184.5"
              fill="#0E243E"
              fill-opacity="0.1"
            />
            <circle
              cx="197.5"
              cy="197.5"
              r="184.5"
              stroke="#7BD7FF"
              stroke-width="6"
            />
          </g>
          <g filter="url(#filter1_f)">
            <circle
              cx="197.5"
              cy="197.5"
              r="184.5"
              fill="#0E243E"
              fill-opacity="0.1"
            />
            <circle
              cx="197.5"
              cy="197.5"
              r="183"
              stroke="white"
              stroke-width="3"
            />
          </g>
          <g filter="url(#filter2_f)">
            <path
              d="M200 143.633C197.607 143.633 195.664 145.576 195.664 147.969C195.664 150.362 197.607 152.305 200 152.305C202.393 152.305 204.336 150.362 204.336 147.969C204.336 145.576 202.393 143.633 200 143.633Z"
              fill="#7BD7FF"
            />
            <path
              d="M128.023 221.68C130.417 221.68 132.359 219.737 132.359 217.344C132.359 214.951 130.417 213.008 128.023 213.008C125.63 213.008 123.688 214.951 123.688 217.344C123.688 219.737 125.63 221.68 128.023 221.68Z"
              fill="#7BD7FF"
            />
            <path
              d="M234.688 100.273C195.652 100.273 163.614 127.187 161.136 161.087C123.96 162.951 89 189.758 89 226.016C89 241.168 94.9958 255.849 105.91 267.481C108.07 276.384 105.448 285.819 98.9422 292.325C97.7024 293.565 97.3314 295.43 98.0022 297.05C98.6729 298.67 100.253 299.727 102.008 299.727C114.374 299.727 126.291 294.877 135.146 286.333C143.772 289.273 155.027 291.055 165.312 291.055C204.343 291.055 236.378 264.148 238.863 230.255C247.941 229.852 257.383 228.175 264.854 225.629C273.709 234.174 285.626 239.023 297.992 239.023C299.747 239.023 301.327 237.967 301.998 236.347C302.669 234.726 302.298 232.862 301.058 231.622C294.552 225.116 291.93 215.681 294.09 206.778C305.004 195.146 311 180.465 311 165.312C311 127.639 273.347 100.273 234.688 100.273ZM165.312 282.383C155.079 282.383 143.418 280.374 135.606 277.266C133.933 276.599 132.021 277.037 130.803 278.367C125.568 284.09 118.76 288.081 111.344 289.915C115.431 282.085 116.474 272.854 113.988 264.108C113.791 263.418 113.427 262.788 112.927 262.275C103.09 252.143 97.6719 239.266 97.6719 226.016C97.6719 195.461 128.647 169.648 165.312 169.648C199.936 169.648 230.352 193.725 230.352 226.016C230.352 257.097 201.175 282.383 165.312 282.383ZM287.073 201.572C286.573 202.087 286.209 202.717 286.012 203.404C283.526 212.151 284.569 221.382 288.656 229.212C281.24 227.379 274.432 223.387 269.197 217.664C267.979 216.336 266.067 215.896 264.394 216.563C257.624 219.256 247.966 221.121 238.849 221.571C237.582 205.174 229.403 189.763 215.42 178.32H271.977C274.371 178.32 276.312 176.379 276.312 173.984C276.312 171.589 274.371 169.648 271.977 169.648H202.099C192.256 164.638 181.205 161.717 169.83 161.104C172.321 131.982 200.459 108.945 234.688 108.945C271.353 108.945 302.328 134.758 302.328 165.312C302.328 178.563 296.91 191.44 287.073 201.572Z"
              fill="#7BD7FF"
            />
            <path
              d="M200 213.008H145.367C142.972 213.008 141.031 214.949 141.031 217.344C141.031 219.739 142.972 221.68 145.367 221.68H200C202.395 221.68 204.336 219.739 204.336 217.344C204.336 214.949 202.395 213.008 200 213.008Z"
              fill="#7BD7FF"
            />
            <path
              d="M200 239.023H128.023C125.629 239.023 123.688 240.964 123.688 243.359C123.688 245.754 125.629 247.695 128.023 247.695H200C202.395 247.695 204.336 245.754 204.336 243.359C204.336 240.964 202.395 239.023 200 239.023Z"
              fill="#7BD7FF"
            />
            <path
              d="M271.977 143.633H217.344C214.949 143.633 213.008 145.574 213.008 147.969C213.008 150.364 214.949 152.305 217.344 152.305H271.977C274.371 152.305 276.312 150.364 276.312 147.969C276.312 145.574 274.371 143.633 271.977 143.633Z"
              fill="#7BD7FF"
            />
          </g>
          <path
            d="M200 143.633C197.607 143.633 195.664 145.576 195.664 147.969C195.664 150.362 197.607 152.305 200 152.305C202.393 152.305 204.336 150.362 204.336 147.969C204.336 145.576 202.393 143.633 200 143.633Z"
            fill="white"
          />
          <path
            d="M128.023 221.68C130.417 221.68 132.359 219.737 132.359 217.344C132.359 214.951 130.417 213.008 128.023 213.008C125.63 213.008 123.688 214.951 123.688 217.344C123.688 219.737 125.63 221.68 128.023 221.68Z"
            fill="white"
          />
          <path
            d="M234.688 100.273C195.652 100.273 163.614 127.187 161.136 161.087C123.96 162.951 89 189.758 89 226.016C89 241.168 94.9958 255.849 105.91 267.481C108.07 276.384 105.448 285.819 98.9422 292.325C97.7024 293.565 97.3314 295.43 98.0022 297.05C98.6729 298.67 100.253 299.727 102.008 299.727C114.374 299.727 126.291 294.877 135.146 286.333C143.772 289.273 155.027 291.055 165.312 291.055C204.343 291.055 236.378 264.148 238.863 230.255C247.941 229.852 257.383 228.175 264.854 225.629C273.709 234.174 285.626 239.023 297.992 239.023C299.747 239.023 301.327 237.967 301.998 236.347C302.669 234.726 302.298 232.862 301.058 231.622C294.552 225.116 291.93 215.681 294.09 206.778C305.004 195.146 311 180.465 311 165.312C311 127.639 273.347 100.273 234.688 100.273ZM165.312 282.383C155.079 282.383 143.418 280.374 135.606 277.266C133.933 276.599 132.021 277.037 130.803 278.367C125.568 284.09 118.76 288.081 111.344 289.915C115.431 282.085 116.474 272.854 113.988 264.108C113.791 263.418 113.427 262.788 112.927 262.275C103.09 252.143 97.6719 239.266 97.6719 226.016C97.6719 195.461 128.647 169.648 165.312 169.648C199.936 169.648 230.352 193.725 230.352 226.016C230.352 257.097 201.175 282.383 165.312 282.383ZM287.073 201.572C286.573 202.087 286.209 202.717 286.012 203.404C283.526 212.151 284.569 221.382 288.656 229.212C281.24 227.379 274.432 223.387 269.197 217.664C267.979 216.336 266.067 215.896 264.394 216.563C257.624 219.256 247.966 221.121 238.849 221.571C237.582 205.174 229.403 189.763 215.42 178.32H271.977C274.371 178.32 276.312 176.379 276.312 173.984C276.312 171.589 274.371 169.648 271.977 169.648H202.099C192.256 164.638 181.205 161.717 169.83 161.104C172.321 131.982 200.459 108.945 234.688 108.945C271.353 108.945 302.328 134.758 302.328 165.312C302.328 178.563 296.91 191.44 287.073 201.572Z"
            fill="white"
          />
          <path
            d="M200 213.008H145.367C142.972 213.008 141.031 214.949 141.031 217.344C141.031 219.739 142.972 221.68 145.367 221.68H200C202.395 221.68 204.336 219.739 204.336 217.344C204.336 214.949 202.395 213.008 200 213.008Z"
            fill="white"
          />
          <path
            d="M200 239.023H128.023C125.629 239.023 123.688 240.964 123.688 243.359C123.688 245.754 125.629 247.695 128.023 247.695H200C202.395 247.695 204.336 245.754 204.336 243.359C204.336 240.964 202.395 239.023 200 239.023Z"
            fill="white"
          />
          <path
            d="M271.977 143.633H217.344C214.949 143.633 213.008 145.574 213.008 147.969C213.008 150.364 214.949 152.305 217.344 152.305H271.977C274.371 152.305 276.312 150.364 276.312 147.969C276.312 145.574 274.371 143.633 271.977 143.633Z"
            fill="white"
          />
          <defs>
            <filter
              id="filter0_f"
              x="0"
              y="0"
              width="395"
              height="395"
              filterUnits="userSpaceOnUse"
              color-interpolation-filters="sRGB"
            >
              <feFlood flood-opacity="0" result="BackgroundImageFix" />
              <feBlend
                mode="normal"
                in="SourceGraphic"
                in2="BackgroundImageFix"
                result="shape"
              />
              <feGaussianBlur
                stdDeviation="5"
                result="effect1_foregroundBlur"
              />
            </filter>
            <filter
              id="filter1_f"
              x="10"
              y="10"
              width="375"
              height="375"
              filterUnits="userSpaceOnUse"
              color-interpolation-filters="sRGB"
            >
              <feFlood flood-opacity="0" result="BackgroundImageFix" />
              <feBlend
                mode="normal"
                in="SourceGraphic"
                in2="BackgroundImageFix"
                result="shape"
              />
              <feGaussianBlur
                stdDeviation="1.5"
                result="effect1_foregroundBlur"
              />
            </filter>
            <filter
              id="filter2_f"
              x="64"
              y="64"
              width="272"
              height="272"
              filterUnits="userSpaceOnUse"
              color-interpolation-filters="sRGB"
            >
              <feFlood flood-opacity="0" result="BackgroundImageFix" />
              <feBlend
                mode="normal"
                in="SourceGraphic"
                in2="BackgroundImageFix"
                result="shape"
              />
              <feGaussianBlur
                stdDeviation="12.5"
                result="effect1_foregroundBlur"
              />
            </filter>
          </defs>
        </svg>
      </template>
    </CategoryHeader>
    <div
      class="container grid__column_12 grid_cols_2 grid_cols_4_tablet grid_cols_6_desktop buttons_grid"
    >
      <Button
        v-for="(cat, i) in categories"
        :key="i"
        :to="cat.path"
        shape="semi_rounded"
        borders="outline"
        class="grid__column_2"
        height="100%"
        >{{ cat.title }}</Button
      >
    </div>
  </div>
</template>

<script>
import CategoryHeader from '../../components/Category/Header/CategoryHeader'
export default {
  layout: 'Category',
  components: {
    CategoryHeader,
  },
  data() {
    return {
      categories: {
        0: {
          path: 'мебель-интерьер-декор',
          title: 'Мебель, интерьер, декор',
        },
        1: {
          path: 'городское-хозяйство',
          title: 'Городское хозяйство',
        },
        2: {
          path: 'энергетика-рeсурсосбережение',
          title: 'Энергетика, рeсурсосбережение',
        },
        3: {
          path: 'промышленность',
          title: 'Промышленность',
        },
        4: {
          path: 'экология-очистка-утилизация',
          title: 'Экология, очистка, утилизация',
        },
        5: {
          path: 'ландшафтный-дизайн-сад',
          title: 'Ландшафтный дизайн, сад',
        },
        6: {
          path: 'электроника-электротехника',
          title: 'Электроника, электротехника',
        },
        7: {
          path: 'транспорт-склад-логистика ',
          title: 'Транспорт, склад, логистика ',
        },
        8: {
          path: 'строительные-технологии',
          title: 'Строительные технологии',
        },
        9: {
          path: 'строительное-оборудование',
          title: 'Строительное оборудование',
        },
        10: {
          path: 'стройматериалы',
          title: 'Стройматериалы',
        },
        11: {
          path: 'архитектура',
          title: 'Архитектура',
        },
        12: {
          path: 'строительство',
          title: 'Строительство',
        },
        13: {
          path: 'отделочные-материалы',
          title: 'Отделочные материалы',
        },
        14: {
          path: 'дизайн-интерьера',
          title: 'Дизайн интерьера',
        },
        15: {
          path: 'ремонт',
          title: 'Ремонт',
        },
        16: {
          path: 'проектирование',
          title: 'Проектирование',
        },
        17: {
          path: 'интерьерный-дизайн',
          title: 'Интерьерный дизайн',
        },
      },
    }
  },
}
</script>

<style scoped lang="scss">
@import '~assets/scss/app/index.scss';
.grid-layout_building {
  max-height: 100%;
  display: grid;
  grid-template-columns: repeat(12, 1fr);
  grid-template-rows: auto auto;
  grid-row-gap: 10px;
  grid-column-gap: 20px;
  height: calc(100vh - 65px);
  padding-bottom: 0.5vw;
}
.buttons_grid {
  grid-gap: 15px;
  grid-auto-rows: 42px;
  @include media_screen(desktop-wide) {
    grid-auto-rows: 90px;
    grid-gap: 30px;
  }
}
</style>
