<template>
  <div class="container_wide layout_category grid-layout_welding">
    <CategoryHeader>
      Сварка
      <template v-slot:right_column>
        <svg
          width="395"
          height="395"
          viewBox="0 0 395 395"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g filter="url(#filter0_f)">
            <circle
              cx="197.5"
              cy="197.5"
              r="184.5"
              fill="#0E243E"
              fill-opacity="0.1"
            />
            <circle
              cx="197.5"
              cy="197.5"
              r="184.5"
              stroke="#7BD7FF"
              stroke-width="6"
            />
          </g>
          <g filter="url(#filter1_f)">
            <circle
              cx="197.5"
              cy="197.5"
              r="184.5"
              fill="#0E243E"
              fill-opacity="0.1"
            />
            <circle
              cx="197.5"
              cy="197.5"
              r="183"
              stroke="white"
              stroke-width="3"
            />
          </g>
          <g clip-path="url(#clip0)" filter="url(#filter2_f)">
            <path
              d="M268.748 149.249H126.25C122.383 149.249 119.249 152.383 119.249 156.251V208.751C119.249 212.617 122.383 215.753 126.25 215.753H268.748C272.615 215.753 275.749 212.617 275.749 208.751V156.251C275.749 152.383 272.615 149.249 268.748 149.249ZM261.746 201.749H133.252V163.253H261.746V201.749Z"
              fill="#7BD7FF"
            />
            <path
              d="M309.998 156.749H298.25V118.752C298.25 104.551 286.698 93 272.497 93H122.501C108.302 93 96.7485 104.551 96.7485 118.752V156.749H85.002C81.1345 156.749 78 159.883 78 163.751V201.249C78 205.117 81.1345 208.251 85.002 208.251H96.7485V231.25C96.7485 258.16 107.23 283.462 126.259 302.492C145.288 321.521 170.588 332 197.5 332C224.41 332 249.712 321.521 268.739 302.492C287.77 283.462 298.25 258.16 298.25 231.25V208.251H309.998C313.866 208.251 317 205.117 317 201.249V163.751C317 159.883 313.866 156.749 309.998 156.749ZM92.0039 194.248V170.753H96.7485V194.248H92.0039ZM284.246 231.25C284.246 279.082 245.332 317.996 197.5 317.996C149.668 317.996 110.752 279.082 110.752 231.25V118.752C110.752 112.274 116.024 107.004 122.501 107.004H272.497C278.976 107.004 284.246 112.274 284.246 118.752V231.25ZM302.996 194.248H298.25V170.753H302.996V194.248Z"
              fill="#7BD7FF"
            />
            <path
              d="M197.5 224.25C195.657 224.25 193.855 224.996 192.548 226.298C191.246 227.601 190.498 229.407 190.498 231.252C190.498 233.095 191.246 234.897 192.548 236.199C193.855 237.506 195.657 238.254 197.5 238.254C199.343 238.254 201.145 237.506 202.452 236.199C203.754 234.897 204.502 233.095 204.502 231.252C204.502 229.407 203.754 227.601 202.452 226.298C201.145 224.996 199.343 224.25 197.5 224.25Z"
              fill="#7BD7FF"
            />
            <path
              d="M242.498 224.25C240.654 224.25 238.847 224.996 237.545 226.298C236.243 227.601 235.496 229.407 235.496 231.252C235.496 233.095 236.243 234.897 237.545 236.199C238.847 237.506 240.654 238.254 242.498 238.254C244.343 238.254 246.144 237.506 247.452 236.199C248.754 234.897 249.5 233.09 249.5 231.252C249.5 229.407 248.754 227.601 247.452 226.298C246.148 224.996 244.343 224.25 242.498 224.25Z"
              fill="#7BD7FF"
            />
            <path
              d="M152.502 224.25C150.657 224.25 148.852 224.996 147.548 226.298C146.246 227.601 145.5 229.407 145.5 231.252C145.5 233.095 146.246 234.897 147.548 236.199C148.856 237.506 150.657 238.254 152.502 238.254C154.346 238.254 156.147 237.506 157.455 236.199C158.757 234.897 159.504 233.095 159.504 231.252C159.504 229.407 158.757 227.601 157.455 226.298C156.153 224.996 154.346 224.25 152.502 224.25Z"
              fill="#7BD7FF"
            />
            <path
              d="M197.5 129.503C199.343 129.503 201.145 128.757 202.452 127.453C203.754 126.148 204.502 124.344 204.502 122.501C204.502 120.657 203.754 118.85 202.452 117.549C201.145 116.247 199.343 115.499 197.5 115.499C195.657 115.499 193.855 116.247 192.548 117.549C191.246 118.856 190.498 120.657 190.498 122.501C190.498 124.344 191.246 126.148 192.548 127.453C193.85 128.757 195.657 129.503 197.5 129.503Z"
              fill="#7BD7FF"
            />
            <path
              d="M242.498 129.503C244.343 129.503 246.144 128.757 247.452 127.453C248.754 126.148 249.5 124.344 249.5 122.501C249.5 120.657 248.754 118.85 247.452 117.549C246.148 116.247 244.343 115.499 242.498 115.499C240.654 115.499 238.847 116.247 237.545 117.549C236.243 118.85 235.496 120.657 235.496 122.501C235.496 124.344 236.243 126.151 237.545 127.453C238.847 128.757 240.654 129.503 242.498 129.503Z"
              fill="#7BD7FF"
            />
            <path
              d="M152.502 129.503C154.346 129.503 156.147 128.757 157.455 127.453C158.757 126.148 159.504 124.344 159.504 122.501C159.504 120.657 158.757 118.856 157.455 117.549C156.147 116.247 154.346 115.499 152.502 115.499C150.657 115.499 148.856 116.247 147.548 117.549C146.246 118.856 145.5 120.657 145.5 122.501C145.5 124.344 146.246 126.148 147.548 127.453C148.856 128.757 150.657 129.503 152.502 129.503Z"
              fill="#7BD7FF"
            />
          </g>
          <g clip-path="url(#clip1)">
            <path
              d="M268.748 149.249H126.25C122.383 149.249 119.249 152.383 119.249 156.251V208.751C119.249 212.617 122.383 215.753 126.25 215.753H268.748C272.615 215.753 275.749 212.617 275.749 208.751V156.251C275.749 152.383 272.615 149.249 268.748 149.249ZM261.746 201.749H133.252V163.253H261.746V201.749Z"
              fill="white"
            />
            <path
              d="M309.998 156.749H298.25V118.752C298.25 104.551 286.698 93 272.497 93H122.501C108.302 93 96.7485 104.551 96.7485 118.752V156.749H85.002C81.1345 156.749 78 159.883 78 163.751V201.249C78 205.117 81.1345 208.251 85.002 208.251H96.7485V231.25C96.7485 258.16 107.23 283.462 126.259 302.492C145.288 321.521 170.588 332 197.5 332C224.41 332 249.712 321.521 268.739 302.492C287.77 283.462 298.25 258.16 298.25 231.25V208.251H309.998C313.866 208.251 317 205.117 317 201.249V163.751C317 159.883 313.866 156.749 309.998 156.749ZM92.0039 194.248V170.753H96.7485V194.248H92.0039ZM284.246 231.25C284.246 279.082 245.332 317.996 197.5 317.996C149.668 317.996 110.752 279.082 110.752 231.25V118.752C110.752 112.274 116.024 107.004 122.501 107.004H272.497C278.976 107.004 284.246 112.274 284.246 118.752V231.25ZM302.996 194.248H298.25V170.753H302.996V194.248Z"
              fill="white"
            />
            <path
              d="M197.5 224.25C195.657 224.25 193.855 224.996 192.548 226.298C191.246 227.601 190.498 229.407 190.498 231.252C190.498 233.095 191.246 234.897 192.548 236.199C193.855 237.506 195.657 238.254 197.5 238.254C199.343 238.254 201.145 237.506 202.452 236.199C203.754 234.897 204.502 233.095 204.502 231.252C204.502 229.407 203.754 227.601 202.452 226.298C201.145 224.996 199.343 224.25 197.5 224.25Z"
              fill="white"
            />
            <path
              d="M242.498 224.25C240.654 224.25 238.847 224.996 237.545 226.298C236.243 227.601 235.496 229.407 235.496 231.252C235.496 233.095 236.243 234.897 237.545 236.199C238.847 237.506 240.654 238.254 242.498 238.254C244.343 238.254 246.144 237.506 247.452 236.199C248.754 234.897 249.5 233.09 249.5 231.252C249.5 229.407 248.754 227.601 247.452 226.298C246.148 224.996 244.343 224.25 242.498 224.25Z"
              fill="white"
            />
            <path
              d="M152.502 224.25C150.657 224.25 148.852 224.996 147.548 226.298C146.246 227.601 145.5 229.407 145.5 231.252C145.5 233.095 146.246 234.897 147.548 236.199C148.856 237.506 150.657 238.254 152.502 238.254C154.346 238.254 156.147 237.506 157.455 236.199C158.757 234.897 159.504 233.095 159.504 231.252C159.504 229.407 158.757 227.601 157.455 226.298C156.153 224.996 154.346 224.25 152.502 224.25Z"
              fill="white"
            />
            <path
              d="M197.5 129.503C199.343 129.503 201.145 128.757 202.452 127.453C203.754 126.148 204.502 124.344 204.502 122.501C204.502 120.657 203.754 118.85 202.452 117.549C201.145 116.247 199.343 115.499 197.5 115.499C195.657 115.499 193.855 116.247 192.548 117.549C191.246 118.856 190.498 120.657 190.498 122.501C190.498 124.344 191.246 126.148 192.548 127.453C193.85 128.757 195.657 129.503 197.5 129.503Z"
              fill="white"
            />
            <path
              d="M242.498 129.503C244.343 129.503 246.144 128.757 247.452 127.453C248.754 126.148 249.5 124.344 249.5 122.501C249.5 120.657 248.754 118.85 247.452 117.549C246.148 116.247 244.343 115.499 242.498 115.499C240.654 115.499 238.847 116.247 237.545 117.549C236.243 118.85 235.496 120.657 235.496 122.501C235.496 124.344 236.243 126.151 237.545 127.453C238.847 128.757 240.654 129.503 242.498 129.503Z"
              fill="white"
            />
            <path
              d="M152.502 129.503C154.346 129.503 156.147 128.757 157.455 127.453C158.757 126.148 159.504 124.344 159.504 122.501C159.504 120.657 158.757 118.856 157.455 117.549C156.147 116.247 154.346 115.499 152.502 115.499C150.657 115.499 148.856 116.247 147.548 117.549C146.246 118.856 145.5 120.657 145.5 122.501C145.5 124.344 146.246 126.148 147.548 127.453C148.856 128.757 150.657 129.503 152.502 129.503Z"
              fill="white"
            />
          </g>
          <defs>
            <filter
              id="filter0_f"
              x="0"
              y="0"
              width="395"
              height="395"
              filterUnits="userSpaceOnUse"
              color-interpolation-filters="sRGB"
            >
              <feFlood flood-opacity="0" result="BackgroundImageFix" />
              <feBlend
                mode="normal"
                in="SourceGraphic"
                in2="BackgroundImageFix"
                result="shape"
              />
              <feGaussianBlur
                stdDeviation="5"
                result="effect1_foregroundBlur"
              />
            </filter>
            <filter
              id="filter1_f"
              x="10"
              y="10"
              width="375"
              height="375"
              filterUnits="userSpaceOnUse"
              color-interpolation-filters="sRGB"
            >
              <feFlood flood-opacity="0" result="BackgroundImageFix" />
              <feBlend
                mode="normal"
                in="SourceGraphic"
                in2="BackgroundImageFix"
                result="shape"
              />
              <feGaussianBlur
                stdDeviation="1.5"
                result="effect1_foregroundBlur"
              />
            </filter>
            <filter
              id="filter2_f"
              x="53"
              y="68"
              width="289"
              height="289"
              filterUnits="userSpaceOnUse"
              color-interpolation-filters="sRGB"
            >
              <feFlood flood-opacity="0" result="BackgroundImageFix" />
              <feBlend
                mode="normal"
                in="SourceGraphic"
                in2="BackgroundImageFix"
                result="shape"
              />
              <feGaussianBlur
                stdDeviation="12.5"
                result="effect1_foregroundBlur"
              />
            </filter>
            <clipPath id="clip0">
              <rect
                width="239"
                height="239"
                fill="white"
                transform="translate(78 93)"
              />
            </clipPath>
            <clipPath id="clip1">
              <rect
                width="239"
                height="239"
                fill="white"
                transform="translate(78 93)"
              />
            </clipPath>
          </defs>
        </svg>
      </template>
    </CategoryHeader>
    <ServicesGrid :cols="3" :col="'12'" width="700">
      <ServiceItem
        :col="'0'"
        class="grid__column_1-tablet grid__column_3-phone"
      >
        <template v-slot:icon>
          <img src="@/assets/img/icons/weld.svg" alt="" />
        </template>
        <template v-slot:default>
          Металло-конструкции
        </template>
        <template v-slot:footer>
          <Button to="металлоконструкции" shape="rounded" borders="outline">
            Подробнее</Button
          >
        </template>
      </ServiceItem>
      <ServiceItem
        :col="'0'"
        class=" grid__column_1-tablet grid__column_3-phone "
      >
        <template v-slot:icon>
          <img src="@/assets/img/icons/pipe.svg" alt="" />
        </template>
        <template v-slot:default>
          Трубопровод
        </template>
        <template v-slot:footer>
          <Button to="трубопровод" shape="rounded" borders="outline">
            Подробнее</Button
          >
        </template>
      </ServiceItem>
      <ServiceItem
        :col="'0'"
        class="grid__column_1-tablet grid__column_3-phone "
      >
        <template v-slot:icon>
          <img src="@/assets/img/icons/ladder.svg" alt="" />
        </template>
        <template v-slot:default>
          Металлические лестницы
        </template>
        <template v-slot:footer>
          <Button to="металлические-лестницы" shape="rounded" borders="outline">
            Подробнее</Button
          >
        </template>
      </ServiceItem>
    </ServicesGrid>
    <SellingButtons></SellingButtons>
  </div>
</template>

<script>
import CategoryHeader from '../../components/Category/Header/CategoryHeader'
import ServiceItem from '../../components/Services/ServiceItem'
import ServicesGrid from '~/components/Services/ServiceGrid'
import { SellingButtons } from '@/components/Ad/Category'
export default {
  layout: 'Category',
  components: {
    CategoryHeader,
    ServicesGrid,
    ServiceItem,
    SellingButtons
  }
}
</script>

<style lang="scss">
@import '~assets/scss/app/index.scss';
.grid-layout_welding {
  max-height: 100%;
  display: grid;
  grid-template-columns: repeat(12, 1fr);
  grid-template-rows: 1fr auto auto;
  grid-row-gap: 10px;
  grid-column-gap: 20px;
  @include on_tablet() {
    height: 88vh;
  }
  @include media_screen(desktop-fhd) {
    grid-template-rows: 2fr 2fr auto;
  }
}
</style>
<style scoped lang="scss">
@import '~assets/scss/app/index.scss';
.services {
  @include media_screen(desktop-fhd) {
    grid-column: 1/13;
  }
}
</style>
